var coll = document.getElementsByClassName("collapsible");
var i;

for (i = 0; i < coll.length; i++) {
  coll[i].addEventListener("click", function() {
    this.classList.toggle("active");
    var content = this.nextElementSibling;
    if (content.style.maxHeight){
      content.style.maxHeight = null;
    } else {
      content.style.maxHeight = content.scrollHeight + "px";
    }
  });
}



function changeLanguage(lang) {

     location.hash = lang;
     location.reload();
   }

   // Define the language reload anchors
   var language = {
     nav:{
       index11:'الرئيسية',
       index12:'تاريخ الاسلام',
       index13:'الصلاة ',
       index14:'القرءان',
       index15:'الاسئله الشائعه',
       index16:'تواصل معنا'

     },
     history_ar:{
       history1:'الدين الإسلامي',
       history2:'البداية',
       history3:'ولتوضيح الموضوع، سأقول بضع كلمات عن عصر ما قبل الإسلام، المعروف باسم عصر الجاهلية.',
       history4:'ظهر النبي محمد (صل ااالله عليه و سلم) في وقت فقد فيه الناس معرفتهم بالدين الصحيح وعادوا إلى عبادة أصنام الحجارة ،الأرض والخبز وحتى الجبن. كما جاء في القرآن الكريم: كانوا يعبدون من دون  الله، ما يؤذيهم، ولا ينفعهم، وهم يقولون: "هؤلاء هم شفعاؤنا لدى الله"',
       history5:'كانوا مهينين في الفكر والأخلاق لدرجة أنهم ، كما ذكر أبو ذر الغفاري ، كانوا يقطعون أصنامهم إلى قطع ويأكلونها. و كان العذر الوحيد المقدم هو أنهم كانوا يتبعون خطوات أجدادهم: عندما يقال لهم: "اتبعوا ما أنزله الله" قالو: "لا. نحن نتبع ما وجدنا آباءنا عليه"',
       history6:'كما انهم كانو يدفنون بناتهم أحياء: عندما يتم إعطاء أي منهن الأخبار الجيدة لفتاة ، يكون وجهه مظلما ويختنق داخليا ، بينما هو يختبئ من الناس بسبب شر البشائر الطيبة التي أعطيت له، سواء كان سيبقيها في الذل، أو يدفنها في الغبار',
       history7:'كانت النساء يتم احتقارهن ، ليس فقط في الجزيرة العربية قبل الإسلام ولكن أيضا في الأراضي الرومانية .ولكن اعلن القرآن صراحة أن الرجال سيتم سؤالهم و حسابهم فيما يتعلق بهذا: عندما يتم سؤال الأنثى (الرضيعة) المدفونة على قيد الحياة يوم القيامه - لأي جريمة  تم قتلها؟',
       history8:'محمد (صل ااالله عليه و سلم) النبي الأخير',
       history9:'نشأ النبي محمد (صل ااالله عليه و سلم) في كنف الله ورعايته. فقد توفي والده عبد الله قبل ولادته ، مما يعني أنه كان عليه أن يضع كل ثقته في الله ويخضع له بالكامل. وقد زار قبر والده في المدينة المنورة بعد سنوات ، وبكى قلبه ، و عند عودته قال: "بكيت على والدي وطلبت من الله أن يغفر له.',
       history10:'بوفاة والده، حرمه الله من كل دعم بشري ووجهه إلى إدراك أنه لا إله إلا الله، الذي ليس لديه شركاء. فقد قام جده وعمه بحمايته إلى حد ما ، لكنه أدرك أن وصيه الحقيقي هو الله. فهو وراء كل شيء وكل سبب ونتيجة ،فقد كان يمكنه تمييز يد الخالق الوحيد للكون والأسباب. ووحدانية الله تتجلى له في ضوء الوحدة الإلهية. أي أنه سيتم اختباره في عالم الحكمة هذا ، كان عليه أن يعتمد كليا على ربه ويطلب منه أي مساعدة، مما يدل على أن الله وحده هو الذي يخلق النتيجة ويعطي النجاح.',
       history12:'كما انه قد فقد والدته أمينة في سن مبكرة. عندما توفيت في أبوة عن عمر يناهز 25 أو 26 عاما في طريق عودتها من زيارتها قبر زوجها في المدينة المنورة ،عندها كان محمد (صل ااالله عليه و سلم) يبلغ من العمر 6 سنوات فقط. وهكذا ، تعلم ألم عدم وجود أب أو أم. ',
       history13:'قبعد ذلك تولى جده عبد المطلب، وهو شيخ كبير المقام في مكة، حمايته. لهذا السبب، أنقذ الله عبد المطلب من سوء الحظ.فقد احتضن حفيده الحبيب ، وقدم له دائما مقعد الشرف في منزله.حيث شعلر أن محمد (صل ااالله عليه و سلم) سيكبر لإنقاذ البشرية. وكان محمد (صل ااالله عليه و سلم) نبيلا ومهذبا لدرجة أن جده توقع نبوته. لم يكن أول أجداده النبلاء الذين فعلوا ذلك ، فقد تنبأ كعب بن لؤي،  بأن الرسول الأخير سيقام من ذريته. ذكره من قبل باسمه فقال',
       history14:'فجأة سيظهر النبي محمد (صل ااالله عليه و سلم).  و سوف يعطي البشارات، وهو صادق في حديثه',
       history15:'عبد المطلب، الذي لم يستطع حتى جيش أبرهة العظيم أن يبكيه، بكى بمرارة عندما أخذ إلى فراش الموت.، وعندما سئل عن الخطأ، أجاب:أنا أبكي لأنني لن أتمكن بعد الآن من احتضان محمد (صل ااالله عليه و سلم)، ثم أضاف: أخشى أن يحدث شيء ما. إلى لؤلؤتي التي لا مثيل لها.',
       history17:'قام أبو طالب بحماية محمد (صل ااالله عليه و سلم) بعناية فائقة. حيث يروي المؤرخون وكتاب السير الذاتية، مثل ابن إسحاق، أن أبو طالب أخذ ابن أخيه إلى سوريا في قافلة تجاريه عندما كان عمره 10 أو 12 عاما. توقفوا في مكان ما بالقرب من دمشق وتركوه، لأنه كان الأصغر، يراقب القافلة، وكان هناك راهب مسيحي بالقرب من البحيرة يراقب القافلة. كان هذا الراهب يتوقع وصول النبي الأخير ،عندها لاحظ أن سحابة تبعت القافله من أجل أن يكون أحد أعضائها مظللا. كان يعتقد ان هذه سمة خاصة للأنبياء حيث يجب أن يكون النبي المتوقع في تلك القافلة.',
       history18:'عندما توقفت القافلة بالقرب من دير لتناول وجبة. لاحظ ان السحابة لا  تحوم فوق القافلة ، فسأل أبو طالب لو أن شخصا ما قد ترك وراءهم. فأجاب أبو طالب أنهم قد تركوا صبيا صغيرا يراقب أمورهم. فطلب منهم الراهب إحضاره و. عندما جاء محمد (صل ااالله عليه و سلم)، أخذ بحيرة أبو طالب إلى جانب وسأله عن علاقته بالصبي.أجاب أبو طالب: إنه ابني، لكن بحيرة اعترض على ذلك، قائلة: لا يمكن أن يكون ابنك. وفقا لكتبنا، يجب أن يكون والده قد توفي قبل ولادته. ثم أضاف: دعني أعطي لك هذه النصيحة. خذ هذا الصبي وارجع مرة أخرى على الفور. فاليهود حاسدون . إذا تعرفوا عليه، فسوف يؤذونه. فقام أبو طالب بتقديم عذرا لاعضاء القافلة وعاد إلى مكة مع ابن أخيه',
       history19:'قام النبي محمد (صل ااالله عليه و سلم) برحلة ثانية عندما كان عمره 25 عاما ، مع قافلة خديجة التجارية ، وهي من سوف يتزوجها لاحقا. وفي الرحلة، واجه بحيرة مرة أخرى. وكان الراهب سعيدا جدا بهذا اللقاء الثاني، وقال له: ستكون نبيا، آخر نبي. أتمنى أنه سيسمح لي الله أن أعيش لأراك قد نشأت فسأتبعك وأحمل حذاءك وأحميك من أعدائك!',
       history20:' ... اقرأ المزيد',
       history21:'السيده  خديجة أم المسلمين',
       history22:'ولدت خديجة بنت خويلد، الزوجة الأولى للنبي محمد (صل ااالله عليه و سلم)، في مكة المكرمة لعائلة تجارية من قبيلة قريش. بعد وفاة والدها ، استعادت أعمال العائلة وطورتها بسرعة كبيرة ، لدرجة ان قوافلها اصبحت مشهورة. ويمكن العثور عليها في جميع أنحاء شبه الجزيرة العربية ، من اليمن إلى شمال سوريا. على الرغم من أنها كانت محاطة من قبل إخوتها وأعمامها ، كانت دائما هي التي لها الكلمة الأخيرة وقادت أعمال العائلة.',
       history23:'خلال فترة الجاهلية (قبل الإسلام) ، كانت خديجة بالفعل امرأة رائعة ، برزت بسبب قوة شخصيتها واستقلاليتها. قرارها باختيار زوجها في عصر يهيمن عليه الرجال وتعدد الزوجات، حيث لم يكن للمرأة أي حقوق ، يوضح هذا تماما.',
       history24:'وفي هذا الصدد، قالت المؤرخة بيتاني هيوغر التي قدمت أيضا الفيلم الوثائقي عندما حكم المغاربة في أوروبا  إن هذا كان من شأنها . الفطنة التي من شأنها أن تضعها على طريق من شأنه أن يغير في نهاية المطاف تاريخ العالم . ولكن قبل تغيير تاريخ العالم، خديجة بدأت أولا بتغيير عقليات من حولها ، من خلال كسب احترام مواطنيها وتأكيد نفسها كامرأة قوية. كانت سيدة أعمال جيدة لدرجة أنه قيل إنها تستطيع مقايضة الغبار بالذهب.',
       history26:'زوجة محمد (صل ااالله عليه و سلم) الأولى، أول امرأة مسلمة',
       history25:'احتاجت القوافل إلى قادة لإرشادهم ، ولأنها لم تكن تحب السفر ، فقد استأجرت رجالا لهذه الأنشطة بعد اختيار دقيق . اضطر هؤلاء الرجال إلى السفر في جميع أنحاء الجزيرة العربية لبيع منتجاتهم. أحدهم كان محمد (صل ااالله عليه و سلم). ',
       history27:'فى ذلك الحين ،كانت قد رفضت الزواج مرة أخرى ورفضت العديد من الخاطبين ، لكن محمد (صل ااالله عليه و سلم) الشاب لفت انتباهها واعجابها صفاته ، التي جعلت خديجة تغير رأيها وتقترح عليه ، على الرغم من حالته المتواضعة. قبل ان يصبح النبي المستقبلي في عام 595 ، بعد الحصول على موافقة عمه وحاميه أبو طالب. يجب أن نتذكر أن محمد (صل ااالله عليه و سلم)ا كان يتيما ، بعد أن فقد كلا والديه. تزوجت خديجة، المعروفة بروحها الحرة، من الشاب محمد (صل ااالله عليه و سلم)، عندما كان بالكاد يبلغ من العمر 25 عاما، بينما كانت تبلغ من العمر 40 عاما.',
       history28:'حدث هذا قبل الوحي. عندما تلقى محمد (صل ااالله عليه و سلم) في عام 610 أول وحي من رئيس الملائكة جبرائيل ، عاد إلى المنزل مرتبكا ، وقرر أن يخبر خديجة بذلك. بعد الاستماع إليه - والأهم من ذلك ، تصديقه - قامت بتهدئته وأخذت تتشاور مع ابن عمها ورقة بن نوفل  ، وكان مؤمن بالتوحيد وعلى دراية بالتقاليد المسيحية. في ذلك الوقت، خشي محمد (صل ااالله عليه و سلم) أن يكون بحوزته جن. فكان ورقة بن نوفل هو الذي أوضح له أن الملاك المعني لم يكن شيطانا ، بل جبريل   رئيس الملائكة الذي جاء للتحدث إلى موسى. ومنذ تلك اللحظة فصاعدا، استمر الوحي للنبي محمد (صل ااالله عليه و سلم). وهكذا ، كما قيل في سجلات الطبري ، أول شخص في التاريخ اعتنق الإسلام كان خديجة.',
       history29:'الوحي',
       history30:'كان محمد (صل ااالله عليه و سلم) يقضي بعض الوقت في التأمل أولا في المنزل ثم بدأ في الذهاب إلى كهف في جبل حراء ، برفقة ابن عمه الشاب علي وابنه بالتبني زيد. و في أحد الأيام ، عندما كان عمره حوالي أربعين عاما ، كان محمد (صل ااالله عليه و سلم) وحيدا ونائما في الكهف في جبل حراء',
       history31:'عندما رأى أمامه "مثل سطوع الفجر" ملاكا أمره أن يقرأ ',
       history32:'قال محمد (صل ااالله عليه و سلم) إنه لا يستطيع فعل ذلك. ',
       history33:'"فأخذني وضغط  علي صدرى بشدة ثم تركنى وكرر الأمر "اقرء".',
       history34:'لا أستطيع أن أقرأ" قلت أنا',
       history35:'ومرة أخرى ضغط علي صدرى حتى أنهكت. ثم قال',
       history36:'"اقرء". قلت: لا أستطيع أن أقرأ. فضغط علي صدرى للمرة الثالثة ثم تركنى وقال:',
       history37:"اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ (1) خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ (2) اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3) الَّذِي عَلَّمَ بِالْقَلَمِ (4) عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ",
       history38:'كان محمد (صل ااالله عليه و سلم) مرعوبا وغير قادر على فهم ما حدث له. هل جن جنونه أو أصبح واحدا من  الشعراء الذين احتقرهم؟ ماذا حدث؟  ترنح أسفل الجبل وسعى إلى خديجة ، وبكى ، "دفئينى!"  "دفئينى!" فقامت خديجة بتغطيته بعباءة وأمسكته اليها وعندما اصبح أكثر هدوءا ، سألته. فأخبرها بما مر به وأنه يخشى أن يكون قد جن جنونه، لكن خديجة لم يكن لديها شك في أن وحيه كان حقيقيا، "فقالت له هذا لا يمكن أن يكون ، فالله لن يعاملك هكذا. فأنت  من الصادقين والحاملين لأعباء الآخرين. أنت تعطي للفقراء، وتطعم الضيوف، وتقف ضد الظلم".',
       history39:'معجزة الإسراء والمعراج',
       history40:'الإسراء والميراج معجزه بالغة الأهمية حدثت في مرحلة بالغة الأهمية من حياة النبي محمد (صل ااالله عليه و سلم) (صل الله عليه وسلم). فقد حدثت هذه التجربة الرفيعة (المعراج = الصعود) في العام الذي فقد فيه النبي اثنين من ركائز الدعم له ز هما عمه أبو طالب (الذي منعت سلطته السياسية ورعايته للنبي أهل مكة من إيذاء النبي) وخديجة (زوجة النبي المحبوبة والمقربة وممولة الحركة الإسلامية الوليدة). ',
       history41:'حدثت الإسراء والميراج في أكثر الأوقات إرهاقا فى حياة النبي الصعبة. فأهل مكة المكرمة. الذين كانو قد دعوه الصادق الامين الجدير بالثقة ، قد رفضو رسالته.وتم نبذ أتباعه . فلقد تحمل هو وحفنة من أتباعه ثلاثة سنوات من الاضطهاد والمقاطعة التي لا هوادة فيها من أهل مكة وذهب في نهاية المطاف إلى الطائف للتبشير برسالته. هناك ولكنهم سخروا منه ورجموه حتى نزف بغزارة. فالتفت إلى الله بالكلمات. "يا الله ، أناشدك ضعف قوتي ، والحد من حيلتى ، و عدم الاحترام والإذلال من الناس. إليك يا صاحب الرحمة أتوجه إليك يا رب الرحماء مضطهد ، وأنت ربي ',
       history42:'ثم في هذا الوقت الأكثر صعوبة وتعبا من حياة الرسول الكريم اللامعة، يمر عليه (عام الحزن) الذي شهد وفاة شخصين مهمين في حياته. أحدهما كان عمه أبو طالب، الذي كان وصيا عليه وحاميه .والأخرى كانت السيده خديجة، زوجته المحبوبة، وصديقته المقربة، وأم جميع أبنائه (باستثناء إبراهيم). وكانت أول من احتضن الإيمان، وممول الحركة الإسلامية الوليدة، وأم المؤمنين. في هذا الوقت حدث الإسراء والميراج (رحلة ليلية و الصعود) . حيث يشير الإسراء والمراج إلى جزأين من رحلة معجزة قام بها النبي محمد (صل ااالله عليه و سلم) في ليلة واحدة من مكة المكرمة إلى القدس ثم الصعود إلى السماء.',
       history43:'و الإسراء هي كلمة عربية تشير إلى رحلة النبي محمد (صل ااالله عليه و سلم) الليلية المعجزة من مكة المكرمة إلى القدس - على وجه التحديد ، إلى موقع المسجد الأقصى ويعتقد أن المسجد في القدس - كما هو مشار إليه في سورة الإسراء وقد تبع الاسراء رحلة المعراج وهى صعوده إلى السماء. ووفقا لبعض علماء الحديث يعتقد أن هذه الرحلة قد تمت قبل ما يزيد قليلا عن عام من هجرة النبي محمد (صل ااالله عليه و سلم) من مكة المكرمة. إلى المدينة المنورة، في 27 رجب.',
       history44:'الصحابة والمؤمنون الأوائل',
       history45:'أول من اعتنق الإسلام في زمن محمد (صل ااالله عليه و سلم) كان',
       history46:'اول سيدة حره تدخل الاسلام',
       history47:' خديجة بنت خويلد',
       history48:'أول رجل بالغ حر يدخل الإسلام وأيضا أول من اسلم من عشيرة هاشم بن قريش.',
       history49:' أبو بكر الصديق ',
       history50:'أول طفل  حر في عائلة محمد يعتنق الإسلام.',
       history51:' علي بن أبي طالب ',
       history52:'اول عبد تم تحريره و تبناه محمد صل الله عليه و سلم يدخل الاسلام',
       history53:' زيد بن حارثة  ',
       history54:'اخرون اعتنقو الاسلام (نوصى بالقراءة عنهم)',
       history55:'من بين أوائل النساء اللواتي اعتنقن الإسلام، بعد والدتهن خديجة',
       history56:' زينب ',
       history57:' رقية ',
       history58:' أم كلثوم ',
       history59:' فاطمه ',
       history60:'ثانى الخلفاء الراشدين',
       history61:' عمر بن الخطاب ',
       history62:'رابع ذكر اعتنق الإسلام، بعد علي وأبو بكر وزيد',
       history63:' عثمان بن عفان ',
       history64:'من اوائل معتنقين الاسلام',
       history65:' ياسر بن عمير ',
       history66:'سابع من اعتنق الاسلام',
       history67:' سمية بنت خباب ',
       history68:' من أوائل المعتنقين للاسلام',
       history69:' سعد بن أبي وقاص ',
       history70:'ثاني امرأة تعتنق الإسلام',
       history71:' لبابة بنت الحارث ',
       history72:'من أوائل المعتنقين للاسلام',
       history73:' بلال بن رباح ',
       history74:'من أوائل المعتنقين للاسلام',
       history75:' عبد الرحمن بن عوف ',
       history76:'من أوائل المعتنقين للاسلام',
       history77:' حمزة بن عبد المطلب ',
       history78:'الشخص الثامن عشر اعتناقا للاسلام',
       history79:' أسماء بنت أبى بكر ',
       history80:'من أوائل المعتنقين للاسلام',
       history81:' مصعب بن عمير ',
       history82:'من أوائل المعتنقين للاسلام',
       history83:' الزبير بن العوام ',
       history84:'من أوائل المعتنقين للاسلام',
       history85:' جعفر بن أبي طالب ',
       history86:'من أوائل المعتنقين للاسلام',
       history87:' سودة بنت زمعة ',
       history88:'أركان الإسلام',
       history89:'من الأمور الأساسية للعقيدة الإسلامية الواجبات والممارسات الأساسية المعروفة باسم أركان الإسلام الخمسة. وهذه هي',
       history90:'  شهادةان لا اله الا الله و ان محمد رسول الله',
       history91:'اقامة و اداء الصلاوات الخمس ',
       history92:'الالتزام بتقديم الصدقات و الزكاة',
       history93:'صيام شهر رمضان ',
       history94:'حج البيت (الكعبه) لمن كان مستطيع',
       history95:'الشهادة',
       history96:'  تعرف مهنة الإيمان باسم الشهادة. وهو شرط أساسي للدخول فى دين الاسلام، وتأكيد للإيمان. حيث يطلب من المسلمين الإعلان عن هذه الشهادة علنا مرة واحدة على الأقل في حياتهم ، لكن معظم المسلمين يتلوونها يوميا كجزء من صلواتهم. في اللغة العربية ، الشهادة هي كما يلي: "أشهد ان لا اله الا الله و اشهد ان محمد رسول الله " أو ببساطة أكثر ، "لا إله إلا الله محمد رسول الله". كما ان الشهادة مصممة ليس فقط للتأكيد العام ولكن أيضا لتشجيع الاقتناع الحقيقي وإخلاص العقل بشأن هذه العبارة أساسية لممارسة دين الإسلام',
       history97:'اقامة و اداء الصلاوات الخمس',
       history98:'الصلاة  واجب أساسي على كل مسلم وركن الإسلام الثاني.حيث يتم تنفيذه خمس مرات في اليوم. هذه الأوقات هي الفجر والظهيرة ومنتصف بعد الظهر وغروب الشمس والمساء. قبل الصلاة  ، هناك طقوس التطهير والوضوء . و عادة ما يعني هذا غسل اليدين والفم والأنف والوجه والأذنين والساعدين والرأس والقدمين ثلاث مرات باليد اليمنى.و تتكون الصلاة  نفسها من اثنتان او ثلاث أو أربع دورات من طقوس الانحناء والسجود جنبا إلى جنب مع تلاوة أجزاء من القرآن الكريم وغيرها من الصلوات باللغة العربية. وينتهي كل شيء بعبارة "السلام عليكم ورحمة الله وبركاته".و يمكن للمسلمين أداء الصلاة  في أي مكان طاهر و نظيف  ، ولكن المكان الأكثر تفضيلا هو المسجد. حيث (المؤذن) يدعو المؤمنين إلى الصلاة  عن طريق (الأذان). واليوم المقدس كل أسبوع هو الجمعة. ويرأس جماعة المصلين في المسجد الإمام. ويجب أن تؤدى الصلوات أينما أقيمت في اتجاه مكة (الكعبه). ويشار إلى هذا الاتجاه بواسطة القبلة ، وهي كلمة تعني "اتجاه الصلاة ". ويشار إليه في المسجد بجدار (يشار إليه باسم جدار القبلة) الذي عادة ما يتم تمييزه بمحراب يسمى المحراب.',
       history99:'تقديم الصدقات و الزكاة',
       history100:'الركن الثالث من أركان الإسلام هو الدعوة إلى الصدقة. وهناك فئتان: إلزامية وطوعية. وتشبه الصدقة الإجبارية  ( الزكاه ) ضريبة لجميع المسلمين، تدفع إما للمجتمع أو الدولة. يتم حسابه على أساس ممتلكات و ثروة الشخص و هى ما يعادل 2.5 ٪ من ثروة الشخص المتراكمة سنويا. وهذا النظام يضمن التشجيع على الشعور بالمشاركة بين مختلف الطبقات الاجتماعية. والصدقة لديها أيضا قيمة روحية كوسيلة للتكفير عن خطايا المرء وضمان الخلاص في الحياة الآخرة. فالصدقة الطوعية يجب أن تؤدى بحريةوبشكل عفوي وسرى مع التقدير والإخلاص.',
       history101:'صيام شهر رمضان',
       history102:'الصيام هو احتفال طقسي خلال شهر رمضان ، الشهر التاسع من التقويم الإسلامي. حيث يطلب من المسلمين الامتناع عن الأكل والشرب والأنشطة الجنسية  و كل الاعمال السيئه بين شروق الشمس وغروبها.كما ان الأمهات المرضعات والحوامل والمرضى والأطفال حتى سن البلوغ يسمح لهم بكسر الصيام. وشهر رمضان مهم لأنه يصادف الوقت في السنة التي بدأ نزول فيها القرآن و ليله القدر فهو شهر اوله رحمة (اول 10 ايام) و اوسطه مغفره و اخره عتق من النار',
       history103:'حج البيت (الكعبه) لمن استطاع ',
       history104:'يتم تشجيع جميع المسلمين الذين لديهم الوسائل المادية والمالية للقيام بزيارة مكة مرة واحدة على الأقل في حياتهم. حيث يتم الحج خلال جزء من الشهر الثاني عشر من التقويم الإسلامي (شهر ذو الحج). حيث يسمح النقل الحديث لملايين المسلمين بالحج إلى مكة المكرمة ، حيث ينصب التركيز على الكعبة.و يرتدي الحجاج الذكور اللون الأبيض (ملابس الاحرام)، الذي يرمز إلى المساواة بين جميع المسلمين أمام الله.وبعد وصول المسلم إلى مكة المكرمة ، يتجول كل حاج عادة حول الكعبة سبع مرات فيما يعرف بالطواف . ويلي ذلك مجموعة من الطقوس الأخرى مثل المشي بين جبلين الصفا و المروة ما يعرف باسم السعى ، والوقوف على جبل عرفات ، والذهاب الى منا ، وكلها مواقع تخلد جوانب من التاريخ الإسلامي والعقيدة. كما يزور الحجاج قبة الصخرة في القدس والمسجد النبوي في المدينة المنورة. ',
       history105:'هجرة النبي محمد من مكة إلى المدينة المنورة',
       history106:'وقد أرسل الله تعالى إلى نبيه محمد صل الله عليه وسلم توجيها لتجديد الدعوة إلى الإسلام. خلال موسم التداول الأول حيث اعتاد النبي صل الله عليه وسلم أن يمر بين الناس في مكة المكرمة ويقول لهم: « قل لا إله إلا الله وسوف تفوز. » و يبشرهم بالأخبار السارة عن المكافأة العظيمة لأولئك الذين آمنوا ويحذر أولئك الذين لا يؤمنون بالتعذيب الشديد في الآخرة و عقاب الله',
       history107:'في بداية دعوته ، آمن به عدد قليل من الناس ، لكن الأغلبية تخلت عن دعوته وأنكرت نبوته. ومع ذلك ، فإن الرسول صل الله عليه وسلم ، استمر والتقى في نهاية المطاف في مكة المكرمة بعض أهل يثرب (المدينة المنورة) من قبائل الأوس و الخزرج. حيث دعاهم إلى اعتناق الإسلام فقبل ستة منهم في البداية. فلما غادروا للذهاب إلى المدينة المنورة أرسل معهم ابن أم مكتوم ومصعب بن عمير ليعلم القرآن لمن آمن ويدعو من لم يعتنق الإسلام . وبالتالي فإن عددهم قد ازداد بحلول العام التالي',
       history108:'ازداد الأذى والمضايقة من المشركين على النبي صل الله عليه وسلم بعد وفاة عمه أبو طالب وزوجته خديجة . وقد تعرض للأذى شخصيا مع أتباعه المضطهدين. منهم بلال ابن رباح الحبشي حيث تعرض للتعذيب و الحرق تحت حرارة الشمس وعلى رمال الصحراء المحترقة حيث اعتادوا على وضع الصخور على صدره خلال وقت الظهيرة الحار. وايضا سمية، والدة عمار حيث توفي زوجها ياسر شهيدا لعدم خضوعه لرغبات مشركين قريش وإصراره على عدم الرجوع عن ايمانه و غيرهم الكثير',
       history109:'لقد تحمل النبي وأصحابه الذين آمنوا به وتسامحوا مع أخطاء المشركين من خلال البقاء ثابتين على طريق الإسلام والعمل وفقا لما يقع على عاتقهم من مسؤليات . حيث عارض مشركون قبيلة قريش الاتصال بهم ومضايقتهم بطرق عديدة.  حيث في أحد الأيام تجرأ شخص يدعى عقبة على المجيء إلى النبي صل الله عليه وسلم ، وأمسكه من كتفيه وخنقه بشدة حتى جاء أبو بكر وأوقفه وقال:',
       history118:'« هل تريد أن تقتل رجلا يقول الله ربي و قدم البراهين من الله »',
       history110:'نصح النبي صل الله عليه وسلم أصحابه بالهجرة إلى الحبشة حيث كان الملك المسيحي العادل في ذلك الوقت - يرأس ويحكم. وقد هاجر عشرة رجال وأربع نساء في البداية وزاد عددهم حتى وصل إلى ثلاثة وثمانين رجلا وسبعة عشر من النساء و الأطفال. ولحماية أنفسهم من الأذى وإيجاد الراحة والعدالة في ظل ملك الحبشة هاجروا خوفا من الفتنة و للحفاظ على تدينهم لله . زكانت هذه أول هجرة في الإسلام.',
       history111:'استقبلهم النجاشي، ملك الحبشة، وعاملهم معاملة حسنة وتمتعوا بالسلام والأمان كضيوف في أرضه. لكن مشركون  قريش حاولو التأثير على النجاشي من خلال تقديم هدايا ثمينة له ولكن دون جدوى. حيث رفض محاولتهم عندما سمع  تلاوة القرآن الكريم عن النبي عيسى ووالدته السيدة مريم. فقد آمن بالمسلمين وحافظ على دعمه لهم وأصبح مسلم شديد التقوى. وعندما زاد عدد المؤمنين في المدينة المنورة، أنزل الله تعالى على النبي صل الله عليه وسلم أن يهاجر . وعندها بدأ المسلمون يهاجرون واحدا تلو الآخر امتثالا لأمر الله وطاعة لأمر النبي صل الله عليه وسلم،ولقد صدم مشركون قريش بشدة من الطريقة السريعة التي انتشر بها دين الإسلام وكانو يريدون أن يجدو طريقة للقضاء عليه.',
       history112:'لاحظ مشركون قبيلة قريش الهجرة المستمرة للصحابة إلى المدينة المنورة. لذلك ، كانوا يخشون أن يفعل النبي نفس الشيء يغادر مكة. حيث عقدوا اجتماعا خضع لرأي عمرو بن هشام (أبو جهل) وتآمروا بشكل جماعي لقتل النبي محمد، صل الله عليه وسلم. ولتجنب الانتقام من عائلة النبي صل الله عليه وسلم ، قررو نشر دمه بين القبائل. لذلك خططوا لجعل رجل واحد من كل قبيلة يقوم بضرب النبي بسيوفهم دفعة واحدة ، وبالتالي سيكون من الصعب السعي للانتقام من جميع القبائل. ولكن نزل الملاك جبريل عليه السلام وأخبر النبي صل الله عليه وسلم بمخطط قريش لقتله وأمره بعدم النوم في مكان نومه المعتاد. كما نقل إليه جبريل إذن الله بالهجرة. وقد طلب النبي من ابن عمه علي بن أبي طالب أن ينام مكانه ويغطي نفسه بشال النبي الأخضر وأن يعيد ممتلكات الناس التي احتفظوا بها مع النبي لحفظها.وقد أطاع على امر النبى صل الله عليه و سلم. وبحلول ذلك الوقت كان المشركين قد تجمعو بالفعل عند باب النبي.',
       history113:'معتمدا اعتمادا كاملا على الله تعالى، خرج رسول الله من بيته ويداه ممتلئتان بالاتربة ورش التراب فوق رؤوس المشركين أثناء تلاوة آيات من سورة يس',
       history114:'وهذا يعني: « لقد صنعنا أمامهم حاجزا و خلفهم حاجزا، وقد قمنا بتغطية اعينهم حتى لا يتمكنوا من الرؤية».',
       history119:'وهكذا قد حجب الله رسوله عن أنظارهم. وفي الصباح دخلو إلى بيت النبي لقتله ولكن بدلا من ذلك وجدوا علي. نائم في مكانه. فانفجروا في غضب من الذل والإحراج ، خاصة عندما وجدوا التراب على رؤوسهم. فقد كانو غاضبين ومتوترين حيث غادروا المنزل بحثا عن اثار النبي. وكشف الله عن نصرة رسوله في حدث مجيد مذهل عندما كان النبي محمد صل الله عليه وسلم وأبو بكر عندما تبعهم المشركون فذهبو إلى كهف ثور ليبتعدو عن الأنظار. فأمر الله الحمام بالجلوس أمام الكهف ووضع البيض. وإلهام عنكبوت لنسج شبكة عند مدخل الكهف. وعندما جاء رجال قريش حاملين سيوفهم ، ووقفوا بجانب الكهف ونظروا حولهم ورأوا الحمام مع بيضهم وشبكة العنكبوت. ظنوا أنه لو دخل النبي ورفيقه الكهف لكانوا قد دمروا البيض والشبكة، فعادوا إلى الوراء وغادروا مهزومين',
       history115:'تميز الكهف باستضافة النبي ورفيقه لمدة ثلاثة أيام. كما ان الأمير بن فهيرة، عبد أبي بكر الذي حرره، اعتاد أن يرعى قطيعه بجوار الكهف حتى يتمكنوا من حلب الأغنام والشرب وكان عبد الله ابن أبي بكر يبقيهم على اطلاع دائم من الأخبار حتى فقد الناس الأمل في العثور عليهم وهدأ الوضع. في اليوم الرابع قدم عبد الله بن العريق اثنين الجمال لهم وتوجهوا نحو المدينة المنورة.وقد خصصت قريش مبلغا كبيرا من المال كمكافأة لكل من أسر النبي محمد ، صل الله عليه وسلم ورفيقه.وكان سوراء بن جوشوم قد أعماه الجشع والمال، واتبع آثار النبي ورفيقه حتى كان أقرب ما يكون مقياس الرمح لبعده عنهما. وكان أبو بكر خائفا على حياة النبي صل الله عليه وسلم،ولكن النبي عزاه وقال بهدوء: «الله معنا» أي أنه يدعمه ويحميه. فغرقت أرجل حصان سوراقة عميقا في الرمال حتى لمست معدته الأرض بينما كان لا يزال يركبها. فشعر بالرعب وأدرك في تلك اللحظة أن معجزة كانت تحدث لحماية نبي عظيم. وطلب من النبي صل الله عليه وسلم أن يدعوه أن تعود أرجل حصانه إلى سطح الأرض، ووعد النبي بأنه سيغادر ولن يكشف لرجال قريش عن آثارهم. ففعل النبي ذلك وغادر سوراقه وهو في حالة صدمة وأوفى بوعده. وقد اعتنق الإسلام بعد ثماني سنوات من ذلك الحدث العظيم.  وقد هاجر رسول الله صل الله عليه وسلم إلى المدينة المنورة مع أبي بكر بعد أن مكث في مكة المكرمة ثلاثة عشر عاما داعيا الناس إلى اعتناق الإسلام والإيمان بإله واحد. وقد كانت هجرة نبينا العظيم الحبيب محمد صل الله عليه وسلم لم تكن من أجل المال ولا من أجل الشهرة، بل كانت طاعة لأوامر الله.حيث لم يمنعهم العدد الكبير من المشركين ولا خطر الرحلة من الهجرة لأن كل ما أرادوه هو طاعة الله. وهكذا ، فإن خطة المشركين قد فشلت',
       history116:' فقد قال الله تعالى في القرآن الكريم في سورة التوبة الآية 40 ',
       history117:'وهذا يعني: « عندما لم تدعموه ، فإن الله قد أيده بالفعل (النبي محمد) عندما حاصرهم الكفار . كان الثاني من اثنين (النبي وأبو بكر) وهما في الكهف فقال لصاحبه: لا تحزن الله يحمينا ومعنا. ووصل النبي إلى المدينة المنورة ليبدأ حقبة جديدة غنية بالمعرفة الإسلامية والأخلاق الحميدة.',
       history120:'العشرة المبشرون بالجنة',
       history121:'وقد ذكر عشرة من صحابة  النبي محمد (صل الله عليه وسلم) بشكل خاص على أنهم وعدوا جنات الرحمن . وأسماؤهم هي',
       history122:'أبو بكر الصديق',
       history123:'عمر بن الخطاب',
       history124:'عثمان بن العفان',
       history125:'علي بن أبي طالب',
       history126:'طلحة بن عبيد الله',
       history127:'الزبير بن العوام',
       history128:'عبد الرحمن بن عوف',
       history129:'سعد بن أبي وقاص',
       history130:'سعيد بن زيد',
       history131:'أبو عبيدة بن الجراح',
       history132:'  رضي الله عنهم جميعا',
       history133:'ومع ذلك ، فإن أقدم نسخة معروفة من القائمة ، والتي قد يعود تاريخها إلى حوالي 724-743 ، تحتوي على اسم أول خليفة أموي',
       history134:'معاوية',
       history135:'وقد اختلف مكان معاوية في الإصدارات اللاحقة بين ابي عبيدة بن الجراح، أو في بعض الإصدارات الأخرى أيضا من قبل محمد نفسه',
       history136:'قصص الفتوحات الإسلامية',
       history137:'الفتوحات الإسلامية لمحمد صل الله عليه و سلم',
       history138:'الفتوحات الإسلامية لمحمد صل الله عليه وسلم  أكثر من ان يتم تغطيتها في مقال واحد ولكن فيما يلي بعض الروابط التي يمكنك قراءتها لتتعرف على اشهر هذه الفتوحات',
       history139:'معركة أحد',
       history140:'معركة بدر',
       history141:'بنو قريظة',
       history142:'معركة مؤتة',
       history143:'معركة خيبر',
       history144:'معركة حنين',
       history145:'معركة تبوك',
       history146:'معركة الخندق',
       history147:'فتح مكة المكرمة',
       history148:'معاهدة الحديبية',
       history149:'لمعرفة المزيد والمزيد عن الفتوحات الإسلامية ، يمكنك الاطلاع على هذه الروابط',
       history150:' المسيرة العسكرية لمحمد ',

     },

   };

   console.log(window.location.hash);
   // Check if a hash value exists in the URL
   if (window.location.hash === '#ar') {

     // Set the content of the webpage
     // depending on the hash value
     if (window.location.hash == "#ar") {
       arabic = 1 ;
       $('span').css( {'text-align': 'right' ,'font-size':'1.5rem'});
       $('h2').css( {'text-align': 'right','margin-right':'4%' , 'font-size':'3rem'});
       $('p').css( {'text-align': 'right' , 'font-size':'1.5rem'});
       $('button').css( {'text-align': 'right'});
       $('h3').css( {'text-align': 'right'});
       $('h4').css( {'text-align': 'right'});
       $('li').css( {'text-align': 'right' });
       $('ul').css( {'text-align': 'right' , 'direction' :'rtl' , 'font-size':'1.3rem'});
       $('ol').css( {'text-align': 'right', 'direction' :'rtl' , 'font-size':'1.3rem'});
       $('nav ul').css( {'text-align': 'left' , 'direction' :'ltr' });
       $('li span').css( {'font-size':'1.3rem' });
       $('li a').css( {'font-size':'1.3rem' });
       $('.footer p').css( {'text-align': 'center', 'font-size':'1rem'});



       $('.index11').html(language.nav.index11);
       $('.index11').attr('href', '/#ar');

       $('.index12').html(language.nav.index12);
       $('.index12').attr('href', '/history#ar');

       $('.index13').html(language.nav.index13);
       $('.index13').attr('href', '/prayer#ar');

       $('.index14').html(language.nav.index14);
       $('.index14').attr('href', '/quran#ar');

       $('.index15').html(language.nav.index15);
       $('.index15').attr('href', '/questions#ar');

       $('.index16').html(language.nav.index16);
       $('.index16').attr('href', '/contact#ar');

       $('#history1').html(language.history_ar.history1);
       $('#history2').html(language.history_ar.history2);
       $('#history3').html(language.history_ar.history3);
       $('#history4').html(language.history_ar.history4);
       $('#history5').html(language.history_ar.history5);
       $('#history6').html(language.history_ar.history6);
       $('#history7').html(language.history_ar.history7);
       $('#history8').html(language.history_ar.history8);
       $('#history9').html(language.history_ar.history9);
       $('#history10').html(language.history_ar.history10);
       $('#history11').html(language.history_ar.history11);
       $('#history12').html(language.history_ar.history12);
       $('#history13').html(language.history_ar.history13);
       $('#history14').html(language.history_ar.history14);
       $('#history15').html(language.history_ar.history15);
       $('#history16').html(language.history_ar.history16);
       $('#history17').html(language.history_ar.history17);
       $('#history18').html(language.history_ar.history18);
       $('#history19').html(language.history_ar.history19);
       $('#history20').html(language.history_ar.history20);
       $('#history21').html(language.history_ar.history21);
       $('#history22').html(language.history_ar.history22);
       $('#history23').html(language.history_ar.history23);
       $('#history24').html(language.history_ar.history24);
       $('#history25').html(language.history_ar.history25);
       $('#history26').html(language.history_ar.history26);
       $('#history27').html(language.history_ar.history27);
       $('#history28').html(language.history_ar.history28);
       $('#history29').html(language.history_ar.history29);
       $('#history30').html(language.history_ar.history30);
       $('#history31').html(language.history_ar.history31);
       $('#history32').html(language.history_ar.history32);
       $('#history33').html(language.history_ar.history33);
       $('#history34').html(language.history_ar.history34);
       $('#history35').html(language.history_ar.history35);
       $('#history36').html(language.history_ar.history36);
       $('#history37').html(language.history_ar.history37);
       $('#history38').html(language.history_ar.history38);
       $('#history39').html(language.history_ar.history39);
       $('#history40').html(language.history_ar.history40);
       $('#history41').html(language.history_ar.history41);
       $('#history42').html(language.history_ar.history42);
       $('#history43').html(language.history_ar.history43);
       $('#history44').html(language.history_ar.history44);
       $('#history45').html(language.history_ar.history45);
       $('#history46').html(language.history_ar.history46);
       $('#history47').html(language.history_ar.history47);
       $('#history48').html(language.history_ar.history48);
       $('#history49').html(language.history_ar.history49);
       $('#history50').html(language.history_ar.history50);
       $('#history51').html(language.history_ar.history51);
       $('#history52').html(language.history_ar.history52);
       $('#history53').html(language.history_ar.history53);
       $('#history54').html(language.history_ar.history54);
       $('#history55').html(language.history_ar.history55);
       $('#history56').html(language.history_ar.history56);
       $('#history57').html(language.history_ar.history57);
       $('#history58').html(language.history_ar.history58);
       $('#history59').html(language.history_ar.history59);
       $('#history60').html(language.history_ar.history60);
       $('#history61').html(language.history_ar.history61);
       $('#history62').html(language.history_ar.history62);
       $('#history63').html(language.history_ar.history63);
       $('#history64').html(language.history_ar.history64);
       $('#history65').html(language.history_ar.history65);
       $('#history66').html(language.history_ar.history66);
       $('#history67').html(language.history_ar.history67);
       $('#history68').html(language.history_ar.history68);
       $('#history69').html(language.history_ar.history69);
       $('#history70').html(language.history_ar.history70);
       $('#history71').html(language.history_ar.history71);
       $('#history72').html(language.history_ar.history72);
       $('#history73').html(language.history_ar.history73);
       $('#history74').html(language.history_ar.history74);
       $('#history75').html(language.history_ar.history75);
       $('#history76').html(language.history_ar.history76);
       $('#history77').html(language.history_ar.history77);
       $('#history78').html(language.history_ar.history78);
       $('#history79').html(language.history_ar.history79);
       $('#history80').html(language.history_ar.history80);
       $('#history81').html(language.history_ar.history81);
       $('#history82').html(language.history_ar.history82);
       $('#history83').html(language.history_ar.history83);
       $('#history84').html(language.history_ar.history84);
       $('#history85').html(language.history_ar.history85);
       $('#history86').html(language.history_ar.history86);
       $('#history87').html(language.history_ar.history87);
       $('#history88').html(language.history_ar.history88);
       $('#history89').html(language.history_ar.history89);
       $('#history90').html(language.history_ar.history90);
       $('#history91').html(language.history_ar.history91);
       $('#history92').html(language.history_ar.history92);
       $('#history93').html(language.history_ar.history93);
       $('#history94').html(language.history_ar.history94);
       $('#history95').html(language.history_ar.history95);
       $('#history96').html(language.history_ar.history96);
       $('#history97').html(language.history_ar.history97);
       $('#history98').html(language.history_ar.history98);
       $('#history99').html(language.history_ar.history99);
       $('#history100').html(language.history_ar.history100);
       $('#history101').html(language.history_ar.history101);
       $('#history102').html(language.history_ar.history102);
       $('#history103').html(language.history_ar.history103);
       $('#history104').html(language.history_ar.history104);
       $('#history105').html(language.history_ar.history105);
       $('#history106').html(language.history_ar.history106);
       $('#history107').html(language.history_ar.history107);
       $('#history108').html(language.history_ar.history108);
       $('#history109').html(language.history_ar.history109);
       $('#history110').html(language.history_ar.history110);
       $('#history111').html(language.history_ar.history111);
       $('#history112').html(language.history_ar.history112);
       $('#history113').html(language.history_ar.history113);
       $('#history114').html(language.history_ar.history114);
       $('#history115').html(language.history_ar.history115);
       $('#history116').html(language.history_ar.history116);
       $('#history117').html(language.history_ar.history117);
       $('#history118').html(language.history_ar.history118);
       $('#history119').html(language.history_ar.history119);
       $('#history120').html(language.history_ar.history120);
       $('#history121').html(language.history_ar.history121);
       $('#history122').html(language.history_ar.history122);
       $('#history123').html(language.history_ar.history123);
       $('#history124').html(language.history_ar.history124);
       $('#history125').html(language.history_ar.history125);
       $('#history126').html(language.history_ar.history126);
       $('#history127').html(language.history_ar.history127);
       $('#history128').html(language.history_ar.history128);
       $('#history129').html(language.history_ar.history129);
       $('#history130').html(language.history_ar.history130);
       $('#history131').html(language.history_ar.history131);
       $('#history132').html(language.history_ar.history132);
       $('#history133').html(language.history_ar.history133);
       $('#history134').html(language.history_ar.history134);
       $('#history135').html(language.history_ar.history135);
       $('#history136').html(language.history_ar.history136);
       $('#history137').html(language.history_ar.history137);
       $('#history138').html(language.history_ar.history138);
       $('#history139').html(language.history_ar.history139);
       $('#history140').html(language.history_ar.history140);
       $('#history141').html(language.history_ar.history141);
       $('#history142').html(language.history_ar.history142);
       $('#history143').html(language.history_ar.history143);
       $('#history144').html(language.history_ar.history144);
       $('#history145').html(language.history_ar.history145);
       $('#history146').html(language.history_ar.history146);
       $('#history147').html(language.history_ar.history147);
       $('#history148').html(language.history_ar.history148);
       $('#history149').html(language.history_ar.history149);
       $('#history150').html(language.history_ar.history150);











     }

   }
